Revit 2027 API
Rebar.CanBeMatchedWithMultipleShapes Method
 Checks if this Rebar can be matched with multiple Rebar Shapes.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeMatchedWithMultipleShapes()
Public Function CanBeMatchedWithMultipleShapes As Boolean
public:
bool CanBeMatchedWithMultipleShapes()
member CanBeMatchedWithMultipleShapes : unit -> bool
Return Value
Boolean
 Returns true if this Rebar can be matched with multiple Rebar Shapes, false otherwise.
Remarks
 A Free Form Rebar that has Workshop Instructions set to Bent is considered that can be matched with multiple shapes.
 A Free Form Rebar that has Workshop Instructions set to Straight or a Shape Driven Rebar is considered that can be matched with only one shape.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace